const keywords: { [key: string]: any } = {
  "100003134727": [
    "卖了几",
    "卖了多少",
    "卖得怎么",
    "卖的怎么",
    "最新数据",
    "环东时代卖了多少",
    "查询环东时代销售数据",
    "查下环东时代销售数据",
  ],
  //  "100003161294": ["樾琴湾卖了多少", "越琴", "樾琴", "樾琴湾二期"],
  "100003161294": [
    "樾琴湾卖了多少",
    "查询樾琴湾销售数据",
    "查下樾琴湾销售数据",
  ],
  "100003209574": [
    "新玥公馆二期卖了多少",
    "查询新玥公馆二期销售数据",
    "查下新玥公馆二期销售数据",
  ],
  "100003209575": [
    "新玥公馆一期卖了多少",
    "查询新玥公馆一期销售数据",
    "查下新玥公馆一期销售数据",
  ],
};
export const getTidByText = (text: string) => {
  let result = "";
  for (const tid in keywords) {
    if (keywords[tid].includes(text)) {
      result = tid;
    }
  }
  return result;
};
